# coding=utf-8
import re
from collections import Counter
from collections import defaultdict
# mans = u"许冠文《摩登保镖》麦嘉《最佳拍档》洪金宝《提防小手》梁家辉《垂帘听政》李修贤《公仆》郑则士《何必有我》周润发《英雄本色》周润发《龙虎风云》洪金宝《七小福》周润发《阿郎的故事》张国荣《阿飞正传》曾志伟《双城故事》梁家辉《92黑玫瑰对黑玫瑰》黄秋生《八仙饭店之人肉叉烧包》梁朝伟《重庆森林》乔宏《女人四十》郑则士《三个受伤的警察》梁朝伟《春光乍泄》黄秋生《野兽刑警》刘德华《暗战》梁朝伟《花样年华》周星驰《少林足球》梁朝伟《无间道》刘德华《大块头有大智慧》梁朝伟《2046》梁家辉《黑社会之龙城岁月》刘青云《我要成名》李连杰《投名状》张家辉《证人》任达华《岁月神偷》谢霆锋《线人》刘德华《桃姐》梁家辉《寒战》张家辉《激战》刘青云《窃听风云3》郭富城《踏血寻梅》"
mans = u"惠英红《长辈》林碧琪《靓妹仔》叶童《表错七日情》斯琴高娃《似水流年》王小凤《错点鸳鸯》张艾嘉《最爱》萧芳芳《不是冤家不聚头》梅艳芳《胭脂扣》张曼玉《不脱袜的人》郑裕玲《表姐，你好嘢！》叶童《婚姻勿语》张曼玉《阮玲玉》袁咏仪《新不了情》袁咏仪《金枝玉叶》萧芳芳《女人四十》张曼玉《甜蜜蜜》张曼玉《宋家王朝》吴君如《古惑仔之洪兴十三妹》罗兰《爆裂刑警》张曼玉《花样年华》张艾嘉《地久天长》李心洁《见鬼》张柏芝《忘不了》章子怡《2046》周迅《如果·爱》巩俐《满城尽带黄金甲》斯琴高娃《姨妈的后现代生活》鲍起静《天水围的日与夜》惠英红《心魔》刘嘉玲《狄仁杰之通天帝国》叶德娴《桃姐》杨千嬅《春娇与志明》章子怡《一代宗师》赵薇《亲爱的》春夏《踏血寻梅》"
mans = u"方育平《父子情》许鞍华《投奔怒海》方育平《半边人》严浩《似水流年》张婉婷《非法移民》方育平《美国心》林岭东《龙虎风云》关锦鹏《胭脂扣》吴宇森《喋血双雄》王家卫《阿飞正传》徐克《黄飞鸿之一壮志凌云》张之亮《笼民》尔冬升《新不了情》王家卫《重庆森林》许鞍华《女人四十》陈可辛《甜蜜蜜》陈果《香港制造》陈嘉上、林超贤《野兽刑警》杜琪峰《枪火》李安《卧虎藏龙》周星驰《少林足球》刘伟强、麦兆辉《无间道》杜琪峰《PTU》尔冬升《旺角黑夜》杜琪峰《黑社会》谭家明《父子》陈可辛《投名状》许鞍华《天水围的日与夜》陈德森《十月围城》徐克《狄仁杰之通天帝国》许鞍华《桃姐》梁乐民、陆剑青《寒战》王家卫《一代宗师》许鞍华《黄金时代》徐克《智取威虎山》"

reresult = re.split(re.compile(u"《*》"), mans)
mans_list = mans.split(" ")
new_list = list()

for man in reresult:
    man = man[: man.find(u"《")]
    # print man.encode("utf-8")
    new_list.append(man)

frequencies = defaultdict(int) #传入int()函数来初始化
for word in new_list:
    frequencies[word] += 1

for k in frequencies:
    print k, frequencies.get(k)
    # print k.decode("utf-8"), frequencies[k]
